namespace Fhey.Framework.Validate
{
    internal class RegxFactory
    {
        //判断输入是否为数字
        public static string IsNumber = @"^\-?[0-9]+(.[0-9]+)?$";

        //是否为整数
        public static string IsInt = @"^\-?[0-9]*$";

        //是否为正数
        public static string IsPositiveNumer = @"^[+]{0,1}(\d+)$|^[+]{0,1}(\d+\.\d+)$";

        //是否为正整数
        public static string IsPositiveInt = @"^[1-9]\d*$";

        //是否为自然数
        public static string IsNaturalNumer = @"^[0-9]*$";

        //是否正浮点数
        public static string IsPositiveFloat = @"^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$";

        //是否为正数，除零外首位不能不为零
        public static string IsMoney = @"(^[1-9]([0-9]+)?(\.[0-9]+)?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)";

        //是否手机号
        public static string IsPhone = @"0?1[0-9]{10}";

        //是否固定电话(国内)
        public static string IsTel = @"0\d{2,3}-\d{7,8}|\d{7,8}";

        //是否Email
        public static string IsEmail = @"[\w!#$%&'*+/=?^_`{|}~-]+(?:\.[\w!#$%&'*+/=?^_`{|}~-]+)*@(?:[\w](?:[\w-]*[\w])?\.)+[\w](?:[\w-]*[\w])?";

        //是否邮政编码
        public static string IsZipCode = @"^[0-9]{6}$";

        //是否QQ
        public static string IsQQ = @"[1-9][0-9]{4,}";

        //身份证验证
        public static string IsIdentity = @"(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}$)";

        //验证日期,支持: YYYY - MM - DD、YYYY/MM/DD、YYYY_MM_DD、YYYY.MM.DD的形式
        public static string IsDate = @"((^((1[8-9]\d{2})|([2-9]\d{3}))([-\/\._])(10|12|0?[13578])([-\/\._])(3[01]|[12][0-9]|0?[1-9])$)|(^((1[8-9]\d{2})|([2-9]\d{3}))([-\/\._])(11|0?[469])([-\/\._])(30|[12][0-9]|0?[1-9])$)|(^((1[8-9]\d{2})|([2-9]\d{3}))([-\/\._])(0?2)([-\/\._])(2[0-8]|1[0-9]|0?[1-9])$)|(^([2468][048]00)([-\/\._])(0?2)([-\/\._])(29)$)|(^([3579][26]00)([-\/\._])(0?2)([-\/\._])(29)$)|(^([1][89][0][48])([-\/\._])(0?2)([-\/\._])(29)$)|(^([2-9][0-9][0][48])([-\/\._])(0?2)([-\/\._])(29)$)|(^([1][89][2468][048])([-\/\._])(0?2)([-\/\._])(29)$)|(^([2-9][0-9][2468][048])([-\/\._])(0?2)([-\/\._])(29)$)|(^([1][89][13579][26])([-\/\._])(0?2)([-\/\._])(29)$)|(^([2-9][0-9][13579][26])([-\/\._])(0?2)([-\/\._])(29)$))/,
        IsYear: /[0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3}";

        //验证年份(年份范围为 0001 - 9999)
        public static string IsYear = @"[0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3}";

        //是否网址
        public static string IsURL = @"^\b(((https?|ftp):\/\/)?[-a-z0-9]+(\.[-a-z0-9]+)*\.(?:com|edu|gov|int|mil|net|org|biz|info|name|museum|asia|coop|aero|[a-z][a-z]|((25[0-5])|(2[0-4]\d)|(1\d\d)|([1-9]\d)|\d))\b(\/[-a-z0-9_:\@&?=+,.!\/~%\$]*)?)$/i";
    }
}
